# DividedSurfaceOffsetFromSurface Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DividedSurfaceOffsetFromSurface Property
ParameterTypeId Class See Also
---
"Offset from surface"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DividedSurfaceOffsetFromSurface { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedSurfaceOffsetFromSurface As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DividedSurfaceOffsetFromSurface {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace